Modes :
    r ->  Open a file for read only

    w ->  Open a file for write only
         ফাইলের আগের ডাটা গুলো মুছে দেয় বা আগের ডাটা না থাকলে নতুন করে ফাইল তৈরি করে, ফাইলের পয়েন্টার ফাইলের শুরুতে শুরু হয়।
         
    a ->  Open a file for write only
         ফাইলের আগের ডাটা গুলো সংরক্ষিত থাকে, ফাইল পয়েন্টার ফাইলের শেষে শুরু হয়। ফাইলটির কোন ডাটা না থাকলে একটি নতুন করে যুক্ত করা হয়।

    x ->  Creates a new file for write only.
         যদি ফাইল আগে থেকেই থাকে তাহলে FALSE এবং একটি warning দেয়।

    r+ ->  Open a file for read/write.
         ফাইল পয়েন্টার ফাইলের শুরুতে শুরু হয়।

    w+ ->  Open a file for read/write.
         ফাইলের আগের ডাটা গুলো মুছে দেয় বা আগের ডাটা না থাকলে নতুন করে ফাইল তৈরি করে, ফাইলের পয়েন্টার ফাইলের শুরুতে শুরু হয়।

    a+ ->  Open a file for read/write.
         ফাইলের আগের ডাটা গুলো সংরক্ষিত থাকে, ফাইল পয়েন্টার ফাইলের শেষে শুরু হয়। ফাইলটির কোন ডাটা না থাকলে একটি নতুন করে যুক্ত করা হয়।
         
    x+ -> Creates a new file for read/writ.
         যদি ফাইল আগে থেকেই থাকে তাহলে FALSE এবং একটি warning দেয়।
